modm-ext/data.modm.io/docs/svd/header_stm32f722xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and Clock Control</description>
      <baseAddress>0x40023800</baseAddress>
      <interrupt>
        <name>RCC</name>
        <description>RCC global Interrupt</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>RCC clock control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSION</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDY</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSITRIM</name>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>HSICAL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HSEON</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDY</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEBYP</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSON</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLON</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLRDY</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLI2SON</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLI2SRDY</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLSAION</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLSAIRDY</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <description>RCC PLL configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLLM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_5</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_7</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_9</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_11</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_13</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_15</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_17</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_18</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_19</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_20</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_21</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_22</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_23</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_24</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_25</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_26</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_27</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_28</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_29</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_30</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_31</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 31</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_32</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 32</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_33</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 33</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_34</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 34</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_35</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 35</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_36</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 36</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_37</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 37</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_38</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 38</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_39</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 39</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_40</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 40</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_41</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 41</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_42</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 42</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_43</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 43</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_44</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 44</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_45</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 45</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_46</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 46</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_47</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 47</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_48</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 48</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_49</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 49</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_50</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 50</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_51</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 51</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_52</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 52</description>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_53</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 53</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_54</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 54</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_55</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 55</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_56</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 56</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_57</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 57</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_58</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 58</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_59</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 59</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_60</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 60</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_61</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 61</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_62</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 62</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_63</name>
                  <description>PLL, PLLI2S and PLLSAI division factor by 63</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>PLLP</name>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>Main PLL division factor for PLLP output by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>Main PLL division factor for PLLP output by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>Main PLL division factor for PLLP output by 6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>Main PLL division factor for PLLP output by 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLSRC</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI16 clock selected as PLL entry clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE clock selected as PLL entry clock source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLQ</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>Main PLL division factor for PLLQ output by 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3</name>
                  <description>Main PLL division factor for PLLQ output by 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>Main PLL division factor for PLLQ output by 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_5</name>
                  <description>Main PLL division factor for PLLQ output by 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>Main PLL division factor for PLLQ output by 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_7</name>
                  <description>Main PLL division factor for PLLQ output by 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>Main PLL division factor for PLLQ output by 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_9</name>
                  <description>Main PLL division factor for PLLQ output by 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <description>Main PLL division factor for PLLQ output by 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_11</name>
                  <description>Main PLL division factor for PLLQ output by 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <description>Main PLL division factor for PLLQ output by 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_13</name>
                  <description>Main PLL division factor for PLLQ output by 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <description>Main PLL division factor for PLLQ output by 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_15</name>
                  <description>Main PLL division factor for PLLQ output by 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
